import React from 'react'
import './Home_Content.css'

function Home_Content(){
    return(
    <div className="home">
        <h2 dir='rtl'>ברוכים הבאים ל- CyberFortress!</h2>
        <p dir='rtl'>CyberFortress מתמחה בהגנה על עסקים וארגונים מכל סוגי איומי הסייבר – מהפשוטים ועד למורכבים ביותר. אנחנו מציעים פתרונות חכמים ומותאמים אישית, הכוללים בדיקות חדירות, ניטור איומים בזמן אמת, הגנה על רשתות ונתונים רגישים, וייעוץ מקצועי להקשחת מערכות המידע. המטרה שלנו היא לא רק להרחיק את האיומים, אלא גם לזהות אותם בזמן ולמנוע נזקים מבעוד מועד. עם צוות מומחים וטכנולוגיות מתקדמות, אנחנו בונים חומות דיגיטליות שישאירו את העסק שלך בטוח מכל זווית. אל תחכה לפריצה – בוא נבנה את ההגנה שלך כבר היום!</p>
        {/* <button type="button">WATCH MORE</button> */}
    </div>
    )
}
export default Home_Content;