import './KoH_Content.css'
import { useState } from 'react'

function KoH_Contant(){
    const [isVisible1, setIsVisible1] = useState(false)
    const [isVisible2, setIsVisible2] = useState(false)
    const [isVisible3, setIsVisible3] = useState(false)
    const [isVisible4, setIsVisible4] = useState(false)
    
    return(
    <div className='koh'>
        <div className="main">
            <h1 className='kohh1'>Kind of Hackers</h1>
            <p className='kohp' dir='rtl'>האקר הוא מומחה טכנולוגי בעל הבנה מעמיקה במחשבים, רשתות ומערכות מידע, המשלב ידע תיאורטי רחב עם יכולות מעשיות לחדור, לנתח, לשנות או לשפר מערכות דיגיטליות. המונח "האקר" נולד בהקשרים חיוביים ותיאר אנשים סקרנים, יצירתיים ובעלי חשיבה מחוץ לקופסה, שהיו מסוגלים למצוא פתרונות מקוריים לבעיות מורכבות ולחקור את גבולות הטכנולוגיה. עם התפתחות המחשוב והאינטרנט, המושג קיבל גם משמעויות שליליות, בעיקר בהקשר לפעולות פריצה בלתי מורשות, גניבת מידע ופגיעה במערכות. בעידן המודרני, האקרים ממלאים תפקיד מרכזי בעולם הסייבר: מצד אחד, הם מהווים איום ממשי העלול לגרום לנזק כלכלי, טכנולוגי ואף בטחוני; ומצד שני, הכישורים והטכניקות שהם מפתחים משמשים גם ליצירת מערכות הגנה מתקדמות, לאיתור חולשות ולחיזוק עמידותן של תשתיות דיגיטליות בפני איומים מתפתחים. כך, דמותו של ההאקר משקפת שילוב מורכב בין חדשנות טכנולוגית לבין פוטנציאל הרסני.</p>
            <br />
            <button className={isVisible1 ? "active-button" : ""} onClick={()=>setIsVisible1(!isVisible1)}>White Hat Hacker</button>
            {isVisible1 && (<p dir='rtl' className='isVisible'>האקר כובע לבן הוא מומחה אבטחת מידע הפועל כחוק ובמטרה חיובית, תוך שימוש בידע וביכולות שלו כדי לאתר, לנתח ולדווח על חולשות אבטחה במערכות מחשב, רשתות, אפליקציות ותשתיות דיגיטליות, לפני שניתן יהיה לנצל אותן לרעה. האקר מסוג זה עובד לעיתים קרובות עבור ארגונים, חברות וגורמי ממשל, או במסגרת פרויקטים של בדיקות חדירה (Penetration Testing) ותוכניות Bug Bounty, שם הוא נדרש לדמות מתקפות אפשריות, אך במטרה לגלות פרצות ולהתריע עליהן. הכובע הלבן שואף להעלות את רמת המודעות הארגונית לאיומים קיימים, להדריך צוותי פיתוח ואבטחה כיצד לתקן את הליקויים שזוהו, ולבנות מערכות עמידות וחסינות יותר בפני התקפות זדוניות. מעבר לכך, הוא גם עוסק בחינוך והדרכה של אחרים בתחום הסייבר, ביצירת כלים לגילוי וניטור איומים, ובתרומה כוללת לקהילה המקצועית על ידי שיתוף ידע ופרסום מחקרים. בשונה מהאקרים בעלי כובעים אחרים, האקר כובע לבן מחויב לאתיקה מקצועית, לחוק ולשקיפות מול הלקוחות והארגונים בהם הוא פועל, והתרומה שלו חיונית ליצירת מרחב דיגיטלי בטוח יותר עבור משתמשים פרטיים, עסקים ומוסדות ציבור.</p>)}
            <br />
            <button className={isVisible2 ? "active-button" : ""} onClick={()=>setIsVisible2(!isVisible2)}>Black Hat Hacker</button>
            {isVisible2 && (<p dir='rtl' className='isVisible'>האקר כובע שחור הוא גורם עוין בעולם הסייבר, אשר משתמש בידע ובמיומנויות טכנולוגיות מתקדמות במחשבים, רשתות ומערכות מידע לצורך פריצה, גניבה, פגיעה או הרס – וכל זאת ממניעים אישיים כמו רווח כספי, יוקרה בקהילות האקרים, נקמה, אידיאולוגיה או סתם הנאה מהכאוס. האקר כובע שחור מנצל חולשות אבטחה, כותב ומפיץ נוזקות, יוצר מתקפות DoS ו־DDoS, עוקף מנגנוני הצפנה ומבצע הונאות פישינג כדי להשיג גישה לא מורשית לנתונים רגישים כגון פרטי אשראי, מידע רפואי, סודות עסקיים או תשתיות קריטיות. לעיתים קרובות הוא פועל כחלק מארגוני פשיעת סייבר מאורגנים או במסגרת טרור סייבר, אך ישנם גם יחידים הפועלים באופן עצמאי. בשונה מהאקר כובע לבן, המניע את עבודתו הוא לא הגנה או שיפור אבטחה אלא ניצול חולשות לטובתו האישית או לטובת אחרים בעלי אינטרס. האקרים אלו מהווים איום מרכזי על עסקים, ממשלות ומשתמשים פרטיים, ופעולותיהם עלולות להוביל לנזקים כלכליים אדירים, לפגיעה במוניטין, להשבתת שירותים חיוניים ואף לסיכון ממשי לחיי אדם כאשר מדובר בהתקפות על מערכות בריאות, תחבורה או תשתיות לאומיות. האקר כובע שחור פועל בניגוד לחוק, ולרוב מסתתר מאחורי אנונימיות ברשת, תוך שימוש בכלי טשטוש, הצפנה ורשתות אנונימיות כמו TOR, כדי להימנע מחשיפה ומרדיפה מצד רשויות אכיפת החוק והקהילה הבינלאומית.</p>)}
            <br />
            <button className={isVisible3 ? "active-button" : ""} onClick={()=>setIsVisible3(!isVisible3)}>Grey Hat Hacker</button>
            {isVisible3 && (<p dir='rtl' className='isVisible'>האקר כובע אפור הוא דמות מורכבת בעולם הסייבר, הנמצא בתווך שבין ההאקר כובע לבן האתי לבין ההאקר כובע שחור הפלילי, כאשר הוא אינו מחויב לחלוטין לכללים החוקיים והאתיים, אך גם לא פועל תמיד מתוך כוונות זדון או רצון לגרום לנזק ישיר. האקר מסוג זה עשוי לנצל חולשות אבטחה שהוא מגלה במערכות מחשב, רשתות או אפליקציות, לעיתים מבלי לקבל הרשאה מבעלי המערכת, אך לא בהכרח כדי לפגוע או להפיק רווח כספי. במקרים רבים האקר כובע אפור ידווח לבסוף על הפרצה שנמצאה, אך הדרך שבה פעל – חדירה ללא אישור – עדיין נחשבת עבירה על החוק ועלולה להעמיד אותו בפני סנקציות משפטיות. לעיתים, האקר כזה מפרסם ממצאים באופן ציבורי כדי להעלות מודעות, להפעיל לחץ על חברות לסגור פרצות אבטחה או כדי לזכות בהכרה מקצועית, אך יש גם מקרים בהם הוא עלול להשתמש במידע לצורך אישי לפני שהוא נחשף. הדמות של ההאקר כובע אפור נתפסת במחלוקת: מצד אחד הוא נתפס כמי שמסייע לחשוף חולשות אמיתיות ובכך מגן בעקיפין על משתמשים, ומצד שני מעשיו נחשבים פריצה לא חוקית ויכולים לסכן את הארגונים והמערכות בהם הוא נוגע. בשל כך, האקר כובע אפור מהווה אזור מוסרי ואתי "אפור" – הוא אינו אויב מובהק אך גם לא שותף נאמן, אלא דמות שמאתגרת את הגבולות שבין אתיקה, חוק וחדשנות טכנולוגית.</p>)}
            <br />
            <button className={isVisible4 ? "active-button" : ""} onClick={()=>setIsVisible4(!isVisible4)}>Script Kiddie</button>
            {isVisible4 && (<p dir='rtl' className='isVisible'>Script Kiddie הוא מונח המתאר אדם חסר ידע טכני מעמיק או ניסיון ממשי בתחום הסייבר, אשר משתמש בכלים, קבצי קוד ותוכנות שנכתבו על ידי האקרים מתקדמים ממנו, במטרה לבצע מתקפות או פעולות פריצה מבלי להבין באמת את המנגנונים הטכנולוגיים שמאחוריהן. בניגוד להאקרים מקצועיים, ה־Script Kiddie לא יוצר בעצמו נוזקות, אקספלויטים או מתקפות מתוחכמות, אלא מסתמך על משאבים מוכנים שניתן למצוא בפורומים, ברשת האפלה או אפילו באינטרנט הפתוח. המניעים לפעולותיו נעים בין סקרנות, רצון להרשים חברים, חיפוש אחר אתגר אישי ועד לגרימת נזק לשם בידור או נקמה, אך ברוב המקרים חסרה לו המומחיות שתאפשר לו להסתיר עקבות או להתמודד עם מערכות אבטחה מתקדמות. בשל חוסר ההבנה העמוק, Script Kiddies עלולים להשאיר אחריהם ראיות דיגיטליות רבות, להיחשף במהירות ולהיעצר על ידי רשויות החוק. למרות זאת, הם עדיין יכולים לגרום לנזקים ממשיים, במיוחד כאשר הם מפעילים מתקפות מוכרות כמו DDoS או משתמשים בקוד זדוני כנגד מטרות לא מוגנות מספיק. הקהילה המקצועית נוטה לזלזל בהם ולראות בהם כמתחזים או "חובבנים" בתחום, אך בפועל הם מציבים סיכון לארגונים קטנים ופרטיים, משום שהם מרבים לנסות מתקפות רבות ללא אבחנה, בתקווה שאחת מהן תצליח.</p>)}
            <br />
        </div>
    </div>
    )
}
export default KoH_Contant














